import 'dart:math';

import 'package:flutter/material.dart';
import 'package:wazakir/size_config.dart';
import 'package:wazakir/theme/colors/light_colors.dart';
import 'package:wazakir/widgets/barMenu.dart';
import 'package:wazakir/widgets/top_container.dart';

class Ahadith extends StatefulWidget {
  @override
  _AhadithState createState() => _AhadithState();
}

class _AhadithState extends State<Ahadith> {
  Widget text(String text) {
    return Center(
        child: Text(
      text,
      style: TextStyle(
          color: Colors.white, fontWeight: FontWeight.bold, fontSize: 26.0),
    ));
  }

  final data = [
    'قال الرسول صلى الله عليه وسلم: (المؤمنُ القويُّ خيرٌ وأحبُّ إلى اللهِ من المؤمنِ الضعيفِ ، وفي كلٍ خيرٌ احرصْ على ما ينفعُك واستعنْ باللهِ ولا تعجِزنَّ ، وإن أصابَك شيءٌ فلا تقلْ : لو أني فعلتُ لكانَ كذا وكذا ، ولكن قلْ قدَّرَ اللهُ وما شاءَ فعلَ فإن لو تفتحُ عملَ الشيطانِ)',
    'قال الرسول صلى الله عليه وسلم: (البِرُّ حُسْنُ الخُلُقِ، وَالإِثْمُ ما حَاكَ في نَفْسِكَ، وَكَرِهْتَ أَنْ يَطَّلِعَ عليه النَّاسُ)',
    'قال الرسول صلى الله عليه وسلم: (اجْتَنِبُوا السَّبْعَ المُوبِقَاتِ قالوا: يا رَسُولَ اللَّهِ، وَما هُنَّ؟ قالَ: الشِّرْكُ باللَّهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إِلَّا بالحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ اليَتِيمِ، وَالتَّوَلِّي يَومَ الزَّحْفِ، وَقَذْفُ المُحْصَنَاتِ المُؤْمِنَاتِ الغَافِلَاتِ)',
    'قال الرسول صلى الله عليه وسلم: (أَرْبَعٌ مَن كُنَّ فيه كانَ مُنَافِقًا خَالِصًا، وَمَن كَانَتْ فيه خَلَّةٌ منهنَّ كَانَتْ فيه خَلَّةٌ مِن نِفَاقٍ حتَّى يَدَعَهَا: إِذَا حَدَّثَ كَذَبَ، وإذَا عَاهَدَ غَدَرَ، وإذَا وَعَدَ أَخْلَفَ، وإذَا خَاصَمَ فَجَرَ. غَيْرَ أنَّ في حَديثِ سُفْيَانَ: وإنْ كَانَتْ فيه خَصْلَةٌ منهنَّ كَانَتْ فيه خَصْلَةٌ مِنَ النِّفَاقِ)',
    'قال الرسول صلى الله عليه وسلم: (إنَّ هذا الدِّينَ يُسرٌ ولنْ يُشادَّ الدِّينَ أحدٌ إلَّا غلَبه فسدِّدوا وقارِبوا وأبشِروا واستعينوا بالغَدوةِ والرَّواحِ وشيءٍ مِن الدُّلجةِ)',
    'قال الرسول صلى الله عليه وسلم: (إنَّما الأعمالُ بالنِّيَّاتِ وإنَّما لِكلِّ امرئٍ ما نوى فمَن كانَت هجرتُهُ إلى اللَّهِ ورسولِهِ فَهجرتُهُ إلى اللَّهِ ورسولِهِ ومن كانت هجرتُهُ لدنيا يُصيبُها أوِ امرأةٍ يتزوَّجُها فَهجرتُهُ إلى ما هاجرَ إليْهِ)',
    'قال الرسول صلى الله عليه وسلم: (عليكمْ بالصِّدقِ؛ فإنَّ الصِّدقَ يهدي إلى البِرِّ، وإن البِرَّ يهدي إلى الجنَّةِ، ولا يزالُ الرَّجلُ يصدُقُ ويتحرَّى الصِّدقَ حتَّى يكتَبَ عندَ اللَّهِ صِدِّيقًا. وإِيَّاكم والكذِبَ، فإن الكذِبَ يهدي إلى الفُجورِ، وإن الفجورَ يهدي إلى النَّارِ، ولا يزالُ الرَّجلُ يكذِبُ ويتحرَّى الكذِبَ حتَّى يُكتبَ عندَ اللَّهِ كذَّابًا)',
    'قال الرسول صلى الله عليه وسلم: (مَن نَفَّسَ عن مُسلِمٍ كُرْبةً من كُرَبِ الدُّنيا، نَفَّسَ اللهُ عنه كُرْبةً من كُرَبِ يومِ القيامةِ، ومَن يسَّرَ على مُعسِرٍ، يسَّرَ اللهُ عليه في الدُّنيا والآخِرةِ، ومَن سَتَرَ على مُسلِمٍ، سَتَرَ اللهُ عليه في الدُّنيا والآخِرةِ، واللهُ في عَونِ العَبدِ ما كان العَبدُ في عَونِ أخيهِ. قال أبو داودَ: لم يذكُرْ عُثمانُ، عن أبي مُعاويةَ: ومَن يسَّرَ على مُعسِرٍ)',
    'قال الرسول صلى الله عليه وسلم: (المؤمنُ الَّذي يخالطُ النَّاسَ ويصبِرُ علَى أذاهُم خيرٌ منَ الَّذي لا يخالِطُ النَّاسَ ولا يصبرُ علَى أذاهم)',
    'قال الرسول صلى الله عليه وسلم: (حَقُّ المُسْلِمِ علَى المُسْلِمِ سِتٌّ قيلَ: ما هُنَّ يا رَسولَ اللهِ؟ قالَ: إذا لَقِيتَهُ فَسَلِّمْ عليه، وإذا دَعاكَ فأجِبْهُ، وإذا اسْتَنْصَحَكَ فانْصَحْ له، وإذا عَطَسَ فَحَمِدَ اللَّهَ فَسَمِّتْهُ، وإذا مَرِضَ فَعُدْهُ وإذا ماتَ فاتَّبِعْهُ)',
    'قال الرسول صلى الله عليه وسلم: (إنَّ اللَّهَ حَرَّمَ علَيْكُم: عُقُوقَ الأُمَّهَاتِ، ووَأْدَ البَنَاتِ، ومَنَعَ وهَاتِ، وكَرِهَ لَكُمْ قيلَ وقالَ، وكَثْرَةَ السُّؤَالِ، وإضَاعَةَ المَالِ)',
    'قال الرسول صلى الله عليه وسلم: (قال اللهُ عزَّ وجلَّ: عَبدي عِندَ ظَنِّهِ بي، وأنا معه إذا دَعاني، وإنْ ذكَرَني في نَفْسِهِ؛ ذكَرتُهُ في نَفْسي، وإنْ ذكَرَني في مَلَإٍ؛ ذكَرتُهُ في مَلَإٍ خَيرٍ منهم وأطيَبَ، وإنْ تقَرَّبَ مِنِّي شِبرًا تقَرَّبتُ منه ذِراعًا، وإنْ تقَرَّبَ ذِراعًا تقَرَّبتُ باعًا، وإنْ أتاني يَمشي أتَيتُهُ هَروَلةً)',
    'قال الرسول صلى الله عليه وسلم: (ألا إنَّ اللَّهَ يَنْهاكُمْ أنْ تَحْلِفُوا بآبائِكُمْ، مَن كانَ حالِفًا فَلْيَحْلِفْ باللَّهِ أوْ لِيَصْمُتْ)',
    'قال الرسول صلى الله عليه وسلم: (أنا و كافلُ اليتيمِ في الجنةِ هكذا و قال بإصبعيْهِ السبابةِ و الوسطى)',
    'قال الرسول صلى الله عليه وسلم: (أثقلُ الصلاةِ على المنافقينَ صلاةُ العشاءِ وصلاةُ الفجرِ ولو يعلمونَ ما فيهما لأَتَوْهُمَا ولو حَبْوًا ولقد هممتُ أن آمُرَ بالصلاةِ فتُقامَ ثم آمُرَ رجلًا يُصلِّي بالناسِ ثم أنطلقُ معي برجالٍ معهم حِزَمٌ من حطبٍ إلى قومٍ لا يشهدونَ الصلاةَ فأحْرِقُ عليهم بُيوتَهم بالنارِ ولو عَلِمَ أحدُكم أنهُ إذا وجدَ عَرْقًا من شاةٍ سمينةٍ أو مِرْمَاتينِ حسَنتَينِ لأتيتُموهما أجمعينَ)',
    'قال الرسول صلى الله عليه وسلم: (إنَّ عبدًا أصاب ذنبًا فقال: ربِّ أذنبْتُ ، فاغفِرْه ، فقال ربُّه : أَعَلِمَ عبدي أنَّ له ربًّا يغفر الذَّنبَ ويأخذُ به ؟ غفرتُ لعبدي ، ثم مكث ما شاء اللهُ ، ثم أصاب ذنبًا ، فقال : ربي أذنبتُ آخرَ ، فاغفِرْ لي قال : أَعِلِمَ عبدي أنَّ له ربًّا يغفر الذَّنبَ . ويأخذُ به ؟ غفرتُ لعبدي ، ثم أصاب ذنبًا ، فقال : ربِّ أذنبتُ آخرَ ، فاغفِرْ لي ، قال : أَعَلِمَ عبدي أنَّ له ربًّا يغفر الذَّنبَ ويأخذُ به ؟ قد غفرتُ لعبدي فلْيعمَلْ ما شاء)',
    'قال الرسول صلى الله عليه وسلم: (ما يُصِيبُ المسلِمَ من نصَبٍ، ولا وصَبٍ، ولا هَمٍّ، ولا حَزَنٍ، ولا أذًى، ولا غَمٍّ، حتى الشوْكةَ يُشاكُها، إلَّا كفَّرَ اللهُ بِها من خطاياهُ)',
    'قال الرسول صلى الله عليه وسلم: (مَن كانت عندَهُ مَظلِمَةٌ لأخيهِ في عِرضٍ، أو في مالٍ، فلْيأتِهِ فلْيُحَلِّلْهُ منها، فإنَّه ليْسَ ثَمَّ دِينارٌ ولا دِرهمٌ، مِن قَبلِ أنْ يُؤخَذَ لأخيهِ من حسناتِهِ، فإنْ لمْ يكُنْ له حسناتٌ أُخِذَ من سيِّئاتِ أخيهِ فطُرِحَتْ عليه)',
    'قال رسول الله صلى الله عليه وسلم: (إِذَا مَاتَ الإنْسَانُ انْقَطَعَ عنْه عَمَلُهُ إِلَّا مِن ثَلَاثَةٍ: إِلَّا مِن صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو له)',
    'عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)',
    'قال رسول الله صلى الله عليه وسلم: (نضَّرَ اللَّهُ امرأً سمِعَ منَّا حديثًا فحفِظَهُ حتَّى يبلِّغَهُ غيرَهُ، فرُبَّ حاملِ فقهٍ ليسَ بفَقيهٍ، ورُبَّ حاملِ فقهٍ إلى من هوَ أفقَهُ منهُ)',
    'قال رسول الله صلّى الله عليه وسلّم: (إنَّ في الجَنَّةِ مِئَةَ دَرَجَةٍ، أعَدَّها اللَّهُ لِلْمُجاهِدِينَ في سَبيلِ اللَّهِ، ما بيْنَ الدَّرَجَتَيْنِ كما بيْنَ السَّماءِ والأرْضِ، فإذا سَأَلْتُمُ اللَّهَ، فاسْأَلُوهُ الفِرْدَوْسَ، فإنَّه أوْسَطُ الجَنَّةِ وأَعْلَى الجَنَّةِ -أُراهُ- فَوْقَهُ عَرْشُ الرَّحْمَنِ، ومِنْهُ تَفَجَّرُ أنْهارُ الجَنَّةِ)',
    'سأل بعض الصحابة -رضي الله عنهم- رسول الله صلى الله عليه وسلم، فقالوا: (يا رسولَ اللَّهِ، حدِّثنا عنِ الجنَّةِ، ما بناؤُها قالَ: لَبنةُ ذَهَبٍ ولَبنةُ فضَّةٍ، ومِلاطُها المِسكُ الأذفرُ، وحصباؤُها اللُّؤلؤُ والياقوتُ، وترابُها الزَّعفرانُ، مَن يدخلُها ينعمُ ولا يبأسُ، ويخلدُ ولا يموتُ، لا تبلَى ثيابُهُ ولا يفنَى شبابُهُ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ أَوَّلَ زُمْرَةٍ تَدْخُلُ الجَنَّةَ علَى صُورَةِ القَمَرِ لَيْلَةَ البَدْرِ، وَالَّتي تَلِيهَا علَى أَضْوَإِ كَوْكَبٍ دُرِّيٍّ في السَّمَاءِ، لِكُلِّ امْرِئٍ منهمْ زَوْجَتَانِ اثْنَتَانِ، يُرَى مُخُّ سُوقِهِما مِن وَرَاءِ اللَّحْمِ، وَما في الجَنَّةِ أَعْزَبُ)',
    'قال رسول الله صلى الله عليه وسلم: (إذا دخل أهلُ الجنةِ الجنةَ، وأهلُ النارِ النارَ، نادى منادٍ: يا أهلَ الجنةِ إنَّ لكم عندَ اللهِ موعدًا يُريدُ أنْ يُنْجِزُكُموه، فيقولونَ: وما هو؟ ألمْ يُثَقِّلِ اللهُ موازينَنا، ويُبَيِّضْ وجوهَنا، ويُدخلْنا الجنةَ، ويُنجِّنا من النارِ؟ فيُكشفُ الحجابُ، فينظرونَ إليه فواللهِ ما أعطاهم اللهُ شيئًا أحبَّ إليهم من النظرِ إليه ولا أقرَّ لأعينِهم)',
    'قال رسول الله صلى الله عليه وسلم: (لَقَابُ قَوْسِ أحَدِكُمْ، أوْ مَوْضِعُ قَدَمٍ مِنَ الجَنَّةِ، خَيْرٌ مِنَ الدُّنْيَا وما فِيهَا، ولو أنَّ امْرَأَةً مِن نِسَاءِ أهْلِ الجَنَّةِ اطَّلَعَتْ إلى الأرْضِ لَأَضَاءَتْ ما بيْنَهُمَا، ولَمَلَأَتْ ما بيْنَهُما رِيحًا، ولَنَصِيفُهَا - يَعْنِي الخِمَارَ - خَيْرٌ مِنَ الدُّنْيَا وما فِيهَا)',
    'قال رسول الله صلّى الله عليه وسلّم: (فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ)',
    'قال رسول الله صلى الله عليه وسلم: (سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ)',
    'قال رسول الله صلى الله عليه وسلم: (مَثَلُ المُؤْمِنِ الذي يَقْرَأُ القُرْآنَ، مَثَلُ الأُتْرُجَّةِ، رِيحُها طَيِّبٌ وطَعْمُها طَيِّبٌ، ومَثَلُ المُؤْمِنِ الذي لا يَقْرَأُ القُرْآنَ مَثَلُ التَّمْرَةِ، لا رِيحَ لها وطَعْمُها حُلْوٌ)',
    'قال رسول الله صلى الله عليه وسلم: (كُلُّ أُمَّتي يَدْخُلُونَ الجَنَّةَ إِلَّا مَن أَبَى، قالوا: يا رَسُولَ اللَّهِ، وَمَن يَأْبَى؟ قالَ: مَن أَطَاعَنِي دَخَلَ الجَنَّةَ، وَمَن عَصَانِي فقَدْ أَبَى)',
    'قال رسول الله صلى الله عليه وسلم: (لا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ عَلَّمَهُ اللَّهُ القُرْآنَ، فَهو يَتْلُوهُ آناءَ اللَّيْلِ، وآناءَ النَّهارِ، فَسَمِعَهُ جارٌ له، فقالَ: لَيْتَنِي أُوتِيتُ مِثْلَ ما أُوتِيَ فُلانٌ، فَعَمِلْتُ مِثْلَ ما يَعْمَلُ)',
    'قال رسول الله صلى الله عليه وسلم: (ما مِن يَومٍ يُصْبِحُ العِبادُ فِيهِ، إلَّا مَلَكانِ يَنْزِلانِ، فيَقولُ أحَدُهُما: اللَّهُمَّ أعْطِ مُنْفِقًا خَلَفًا، ويقولُ الآخَرُ: اللَّهُمَّ أعْطِ مُمْسِكًا تَلَفًا)',
    'قال رسول الله صلى الله عليه وسلم: (قالَ اللَّهُ تَبارَكَ وتَعالَى: أنا أغْنَى الشُّرَكاءِ عَنِ الشِّرْكِ، مَن عَمِلَ عَمَلًا أشْرَكَ فيه مَعِي غيرِي، تَرَكْتُهُ وشِرْكَهُ)',
    'رُوي عن عائشة أم المؤمنين -رضي الله عنها- أنها قالت: (أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَدَعُ أرْبَعًا قَبْلَ الظُّهْرِ، ورَكْعَتَيْنِ قَبْلَ الغَدَاةِ)',
    'قال رسول الله صلى الله عليه وسلم: (كَلِمَتانِ حَبِيبَتانِ إلى الرَّحْمَنِ، خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ: سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ)',
    'قال رسول الله صلى الله عليه وسلم: (مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ)',
    'قال رسول الله صلى الله عليه وسلم: (لَعَنَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ)',
    'قال رسول الله صلى الله عليه وسلم: (رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ قيلَ: مَنْ؟ يا رَسولَ اللهِ، قالَ: مَن أدْرَكَ والِدَيْهِ عِنْدَ الكِبَرِ، أحَدَهُما، أوْ كِلَيْهِما، ثُمَّ لَمْ يَدْخُلِ الجَنَّةَ)',
    'سأل رجل رسول الله -صلى الله عليه وسلم- فقال: (يا رَسولَ اللَّهِ، مَن أحَقُّ النَّاسِ بحُسْنِ صَحَابَتِي؟ قالَ: أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أبُوكَ)',
    'قال رسول الله صلى الله عليه وسلم: (أيَعجِزُ أحَدُكم أنْ يَكسِبَ كُلَّ يَومٍ ألْفَ حَسَنةٍ؟ فقال رَجُلٌ مِن جُلَسائِهِ: كيف يَكسِبُ أحَدُنا ألْفَ حَسَنةٍ؟ قال: يُسبِّحُ مِئةَ تَسبيحةٍ؛ تُكتَبُ له ألْفُ حَسَنةٍ، أو يُحَطُّ عنه ألْفُ خَطيئةٍ)'
  ];

  Random rnd = new Random();

  @override
  Widget build(BuildContext context) {
    int r = rnd.nextInt(data.length);
    return Scaffold(
      bottomNavigationBar:
          BarMenu(Colors.white, Colors.white, Colors.white, Colors.white),
      backgroundColor: LightColors.kLightYellow,
      body: SafeArea(
        child: Column(
          children: <Widget>[
            TopContainer(
              width: MediaQuery.of(context).size.width,
              height: heightSize(context, 12),
              child: text('أحاديث'),
            ),
            Expanded(
              child: InkWell(
                onTap: () {
                  setState(() {});
                },
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: <Widget>[
                    Container(
                      decoration: BoxDecoration(
                          color: Colors.indigo[400],
                          borderRadius: BorderRadius.all(Radius.circular(15))),
                      width: MediaQuery.of(context).size.width * 0.9,
                      child: Padding(
                        padding: const EdgeInsets.all(5.0),
                        child: Padding(
                          padding: const EdgeInsets.all(10.0),
                          child: Text(data[r].toString(),
                              textAlign: TextAlign.center,
                              style: TextStyle(
                                  color: Colors.white,
                                  fontSize: 17,
                                  fontWeight: FontWeight.bold)),
                        ),
                      ),
                    ),
                  ],
                ),
              ),
            )
          ],
        ),
      ),
    );
  }
}
