import 'dart:math';

import 'package:flutter/material.dart';
import 'package:wazakir/theme/colors/light_colors.dart';
import 'package:wazakir/widgets/barMenu.dart';
import 'package:wazakir/widgets/top_container.dart';

class Azkar extends StatefulWidget {
  @override
  _AzkarState createState() => _AzkarState();
}

class _AzkarState extends State<Azkar> {
  final data = [
    'اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ ، يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً ، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً ، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً ، اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ ، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ',
    'اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ ، يَا مُقِيلَ العَثَرَاتِ ، يَاقَاضِيَ الحَاجَاتِ ، يَا كَاشِفَ الكَرُبَاتِ ، يَا رَفِيعَ الدَّرَجَاتِ ، وَيَا غَافِرَ الزَّلاَّتِ ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأحْيَاءِ مِنْهُم وَالأمْوَاتِ ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ',
    'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ، الأَحَدُ الصَّمَدُ ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ',
    'اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي',
    'اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ',
    'اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي ، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي',
    'اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي',
    'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ',
    'اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِ',
    'اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ',
    'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ',
    'اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِ',
    'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِ',
    'اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ',
    'اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ ، وَالإِقْرَارِ بِكَ ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيْهِ ؛ الكُفْرِ وَالجَحْدِ بِكَ ، اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا',
    'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ ، وما أنت أعلم به مني ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ',
    'اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ',
    'اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيمِ',
    'اللَّهُمَّ أَقِلْ عَثَرَاتِنَا ، وَاغْفِرْ زَلاَّتِنَا ، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا ، وَتَوَفَّنَا مَعَ الأَبْرَارِ',
    'اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ ، اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَسِ',
    'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ',
    'اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، أَنْ تَغْفِرَ لِي ذُنُـوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ',
    'اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى ، يَامَنْ خَلَقَ فَسَوَّى وَقدَّرَ فَهَدَى ، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى ، يَامَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا ، وَأَسْعَدَ وَأَشْقَى ، وَأَوْجَدَ وَأَبْلَى ، وَرَفَعَ وَخَفَضَ ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ',
    'اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ ، وَأَجْرَى الأَنْهَارَ ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ ، يَا مَنْ هَدَى مِنْ ضَلالَةٍ ، وَأَنْقَذَ مِنْ جَهَالَةٍ ، وَأَنَارَ الأَبْصَارَ ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ',
    'اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ',
    'اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا ، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ',
    'اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ ، وَإسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ',
    'اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي',
    'اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ، وَفِي سَمْعِي نُوراً ، وَفِي بَصَرِي نُوراً ، وَعَنْ يَمِينِي نُوراً ، وَعَنْ شِمَالِي نُوراً ، وَمِنْ بَيْنَ يَدَيَّ نُوراً ، وَمِنْ خَلْفِي نُوراً ، وَمِنْ فَوقِي نُوراً ، وَمِنْ تَحْتِي نُوراً ، وَاجْعَلْ لِي نُوراً ، وَأَعْظِمْ لِي نُوراً',
    'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ ، وَخَوفَ العَالِمِينَ بِكَ ، وَيَقِينَ المُتَوَكِّلِينَ عَلَـيْكَ ، وَتَوَكُّلَ المُوقِنِينَ بِكَ ، وَإِنَابَةَ المُخْبِتِينَ إِلَيْكَ ، وَإِخْبَاتَ المُنِيبينَ إِلَيْكَ ، وَشُكْرَ الصَّابِرِينَ لَكَ ، وَصَبْرَ الشَّاكِـرِينَ لَكَ ، وَلَحَاقاً بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ',
    'اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيكَ تَوَكَّلْتُ ، وَإِلَيكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ ، لا إِلَهَ إِلاَّ أَنْتَ ، أَنْ تُضِلَّنِي ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ',
    'اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ',
    'اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى ، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ ، فَالِقَ الإِصْبَاحِ ، وَجَاعِلَ اللَّيلِ سَكَناً ، وَالشَّمْسَ والقَمَرَ حُسْبَاناً ، يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ',
    'اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَى جَدُّكَ ، وَلا إِلَهَ غَيْرُكَ',
    'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ ، لا إِلَهَ إِلاَّ أَنْتَ ، المَنَّانُ ، بَدِيعُ السَّمَاوَات وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ',
    'اللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا ، وَالأَرْضُ بِسُهُولِـــهَا وَفِجَاجِهَا ، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا ، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا ، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا ، وَالسِّبَاعُ فِي فَلَوَاتِهَا ، وَالطَّيْرُ فِي وَكَنَاتِهَا ، يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغََرِهَا ، وَالمَجَرَّاتُ عَلَى كِبَرِهَـا ، يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ ، وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه',
    'اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى ، يَا رَحْمَاناً عَلَى العَرْشِ اسْتَوَى ، يَا مَنْ لَهُ مَا فِي السَّمَاوَات وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا ، وَمَا تَحْتَ الثَّرَى ، يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى ، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى ، يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى',
    'اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ',
    'اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ القَبْرِ ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ، وَالجُبْنِ وَالبُخْلِ ، وَالهَرَمِ وَالقَسْوَةِ ، وَالغَفْلَةِ وَالعَيْلَةِ وَالذِّلَّةِ ، وَالمَسْكَنَةِ ، وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ ، وَالفُسُوقِ وَالشِّقَاقِ وَالنِّفَاقِ، وَالسُّمْعَةِ وَالرِّيَاءِ ، وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبَكَمِ ، وَالجُنُونِ ، وَالجِذَامِ ، وَالبَرَصِ ، وَسَيِّئِ الأَسْقَامِ',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ، وَالجُبْنِ ، وَالبُخْلِ ، وَالهَرَمِ ، وَعَذَابِ القَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا ، أَنْتَ وَلِيُّهَا وَمَوْلاَهَا',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ ، وَمِنْ قَلْبٍ لا يَخْشَعُ ، وَمِنْ نَفْسٍ لا تَشْبَعُ ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيعِ سَخَطِكَ',
    'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ التَّـرَدِّي ، وَالهَدْمِ ، وَالغَرَقِ ، وَالحَرْقِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيطَانُ عِنْدَ المَوْتِ ، وَأَعُوذُ بِكَ مِنْ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِراً ، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغاً'
  ];

  Widget text(String text) {
    return Center(
        child: Text(
      text,
      style: TextStyle(
          color: Colors.white, fontWeight: FontWeight.bold, fontSize: 26.0),
    ));
  }

  Random rnd = new Random();

  @override
  Widget build(BuildContext context) {
    int r = rnd.nextInt(data.length);
    return Scaffold(
      bottomNavigationBar:
          BarMenu(Colors.white, Colors.white, Colors.white, Colors.white),
      backgroundColor: LightColors.kLightYellow,
      body: SafeArea(
        child: Column(
          children: <Widget>[
            TopContainer(
              width: MediaQuery.of(context).size.width,
              height: 100,
              child: text('أدعية مختارة'),
            ),
            Expanded(
                child: Column(
                mainAxisAlignment: MainAxisAlignment.center,
                children: <Widget>[
                  Container(
                    decoration: BoxDecoration(
                        color: Colors.indigo[400],
                        borderRadius: BorderRadius.all(Radius.circular(15))),
                    width: MediaQuery.of(context).size.width * 0.9,
                    child: Padding(
                      padding: const EdgeInsets.all(10.0),
                      child: Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text(data[r].toString(),
                            textAlign: TextAlign.center,
                            style: TextStyle(
                                color: Colors.white,
                                fontSize: 18,
                                fontWeight: FontWeight.bold)),
                      ),
                    ),
                  ),
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}
